spec/fixtures/requests/order_service/set_orders_export_status/with_two_client_order_ids.xml

<?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://api.channeladvisor.com/webservices/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="http://api.channeladvisor.com/webservices/" xmlns:ins1="http://api.channeladvisor.com/datacontracts/orders"><env:Header><ins0:APICredentials><ins0:DeveloperKey>$$DEVELOPER_KEY$$</ins0:DeveloperKey><ins0:Password>$$PASSWORD$$</ins0:Password></ins0:APICredentials></env:Header><env:Body><ins0:SetOrdersExportStatus><ins0:accountID>$$ACCOUNT_ID$$</ins0:accountID><ins0:clientOrderIdentifiers><ins0:string>ABCD1234</ins0:string><ins0:string>EFGH5678</ins0:string></ins0:clientOrderIdentifiers><ins0:markAsExported>true</ins0:markAsExported></ins0:SetOrdersExportStatus></env:Body></env:Envelope>